Revit 2027 API
ColorFillFailures Properties
The BuiltInFailures.ColorFillFailures type exposes the following members.
Properties
Name | Description
OnlyOneColorFillNonPlan |  A Color Fill Legend can only be placed in a Floor Plan View or a Section View.
SymtemColorFillLegendNotAllowed |  [Category name] Color Fill Legend can only be placed in a Floor Plan View.
Top
See Also
Reference
BuiltInFailures.ColorFillFailures Class
Autodesk.Revit.DB Namespace